{
	"main": {
		"name":"Rami Taleb",
		"description":"An Ottawa based Software Engineering student ",
		"image":"profilepic.jpg",
		"contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
		"email": "ramitaleb32@gmail.com",
		"phone": "613-890-0906",
		"website": "ramitaleb.github.io",
		"resumedownload":"https://drive.google.com/file/d/1BOb5lLNLTFS-Q5v9COV08AVcKRa0BPy9/view?usp=sharing",
		"social":[
			{
				"name":"github",
				"url":"http://github.com/ramitaleb",
				"className":"fa fa-github"
			},
			{
				"name":"linkedin",
				"url":"https://www.linkedin.com/in/rami-taleb-755851112/",
				"className":"fa fa-linkedin"
			},
			{
				"name":"mail",
				"url":"mailto:ramitaleb32@gmail.com",
				"className":"fa fa-envelope"
			}
		]
	},
	"resume":{
		"skillmessage":"Here you can create a short write-up of your skills to show off to employers",
		"education":[
			{
				"school":"University of Ottawa",
				"degree":"Software Engineering (Engineering Management and Entrepreneurship, CO-OP)",
				"graduated":"Expected Fall 2019",
				"description":"Awarded Engineering Merit scholarship and placed on Dean’s Honour List. Member of uOttawa’s Software Engineering Student Association."
			}
		],
		"work":[
			{
				"company":"IBM",
				"title":"Software Developer ",
				"years":"September 2018 - December 2018, May 2019 - August 2019",
				"description":"Assisted in the front end development (NodeJS) of Explore & Storytelling in Cognos Analytics. Worked with offering managers to come up with a solution to reduce the coupling of two large components & worked to implement this change. Implemented a redesign of a visualization comparison page to ensure responsiveness and ease of use, significantly improving the user experience. Implemented fixes for a multitude of defects including issues related to playback, data-widgets, copy/paste, accessibility & more. Wrote functional UI-based tests with Selenium for Storytelling’s core features."
			},
			{
				"company":"CENX",
				"title":"Software Developer",
				"years":"January 2017 - August 2017",
				"description":"Learned and used Clojure to resolve network related issues regarding visualizations, alarms and more for a top 3 American mobile providers. Took initiative on a new project involving big data manipulation. Wrote parsers using Nifi to format data being streamed into the product. Actively participated in daily standups, biweekly sprints and retrospectives."
			},
			{
				"company":"uOttawa SASS-IT",
				"title":"Full Stack Developer ",
				"years":"May 2016 - December 2017",
				"description":"Assisted in the development of Ventus, a student services web application for Student Academic Success Service of the University of Ottawa. Performed significant re-engineering of software architecture by implementing object-oriented practices in PHP and JavaScript. Worked to improve the SDLC by pioneering the use of Github Project Boards to the team and regularly maintaining it. Assisted in project planning, requirement prioritization, feature development, and peer review of code."
			}
		]
	},
	"portfolio":{
		"projects": [
			{
				"title":"EduRoad",
				"category":"A site to help students choose post secondary institutions and programs.",
				"image":"eduroad.png",
				"url":"https://eduroad.ca"
			},
			{
				"title":"RestauRate",
				"category":"Web app to post/read reviews on restaurants and their menu items.",
				"image":"restaurate.png",
				"url":"https://github.com/RamiTaleb/RestauRate"
			},
			{
				"title":"LooT",
				"category":"Android app to manage unused items in your household.",
				"image":"Loot.jpg",
				"url":"https://github.com/anthonyanader/loot"
			},
			{
				"title":"CookR",
				"category":"Android app to help suggest recipes given ingredients on hand.",
				"image":"cookr.jpg",
				"url":"https://github.com/IMFIL/cookR"
			}
		]
	}
}
